# DataFrame
## 행과 열의 삭제
- 행삭제 : df.drop(행인덱스or배열, axis=0\Default\)
- 행삭제 : df.drop(열이름or배열, axis=1)
- inplace가 False\Default\인 경우 처리에대한 결과를 반환,
- inplace가 True인 경우 처리에대한 결과를 적용.

In [1]:
import pandas as pd
import numpy as np
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

exam_data={'수학':[90,80,70],'영어':[98,89,95],'음악':[85,95,100],'체육':[100,95,95]}
df= pd.DataFrame(exam_data,index=['학생'+str(x) for x in range(1,4)])
df

     수학  영어   음악   체육
학생1  90  98   85  100
학생2  80  89   95   95
학생3  70  95  100   95

In [2]:
df2=df[:]
df2

     수학  영어   음악   체육
학생1  90  98   85  100
학생2  80  89   95   95
학생3  70  95  100   95

In [3]:
a=df2.drop('학생1')
df
a
b=df.drop(['학생1','학생2'])
b

     수학  영어   음악   체육
학생1  90  98   85  100
학생2  80  89   95   95
학생3  70  95  100   95

     수학  영어   음악  체육
학생2  80  89   95  95
학생3  70  95  100  95

     수학  영어   음악  체육
학생3  70  95  100  95

In [4]:
df=pd.DataFrame(exam_data,index=['학생1','학생2','학생3'])
df
df.drop('수학',axis=1,inplace=True)
df

     수학  영어   음악   체육
학생1  90  98   85  100
학생2  80  89   95   95
학생3  70  95  100   95

     영어   음악   체육
학생1  98   85  100
학생2  89   95   95
학생3  95  100   95

In [5]:
df.drop(['영어','음악'],axis=1,inplace=True)
df

      체육
학생1  100
학생2   95
학생3   95